/*
 * Copyright 2026 Egor Khomenko (Egorich88)
 *
 * Licensed under the Apache License, Version 2.0
 */

/**
 * ============================================================================
 * LoadingLogo.tsx
 * ============================================================================
 *
 * Компонент отображения логотипа.
 *
 * Позже будет содержать:
 *
 * • SVG логотип Kafka;
 * • градиентный текст KSC;
 * • эффект приближения;
 * • свечение;
 * • масштабирование.
 */

export default function LoadingLogo() {
    return null;
}