/*
 * Copyright 2026 Egor Khomenko (Egorich88)
 *
 * Licensed under the Apache License, Version 2.0
 */

/**
 * ============================================================================
 * LoadingProgress.tsx
 * ============================================================================
 *
 * Компонент прогресс-бара.
 *
 * Будет отвечать за:
 *
 * • отображение процентов;
 * • заполнение полосы;
 * • анимацию движения;
 * • визуальные эффекты.
 */

export default function LoadingProgress() {
    return null;
}