/*
 * Copyright 2026 Egor Khomenko (Egorich88)
 *
 * Licensed under the Apache License, Version 2.0
 */

/**
 * ============================================================================
 * useLoading.ts
 * ============================================================================
 *
 * Пользовательский React Hook управления экраном загрузки.
 *
 * На текущем этапе логика отсутствует.
 *
 * Позже здесь будет реализовано:
 *
 * • управление прогрессом;
 * • переход между этапами;
 * • отображение процентов;
 * • завершение загрузки.
 */

export function useLoading() {
    return {};
}